<!DOCTYPE HTML>
<html lang="en" >
    
    <head>
        
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>概述 | 概述</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="Rainbow 是基于 HTML5、CSS3 和 JavaScript 对 EAD 服务引擎提供的 Rest Service API 进行解析和渲染，动态生成 Web 用户交互界面的前端应用程序框架。本文对 Rainbow 前端框架进行详细说明，包含了开发 Rainbow 所使用的关键技术介绍，Rainbow 关键术语定义。分别从架构概述、核心框架选型、模块及程序运行流程、视图、组件、界面主题、国际化语言支持、扩展开发、生成工具等方面综合进行概要说明。本文旨在描述 Rainbow 的设计开发思想和运行原理及相关生态依赖，如果要涉及实质的扩展开发请参考《扩展开发指南》。">
        <meta name="generator" content="GitBook 2.6.7">
        
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-search/search.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./Overview.html" />
    
    

        
    </head>
    <body>
        
        
    <div class="book"
        data-level="0"
        data-chapter-title="概述"
        data-filepath="README.md"
        data-basepath="."
        data-revision="Mon Mar 21 2016 17:37:03 GMT+0800 (CST)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter active" data-level="0" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                        概述
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="Overview.html">
            
                
                    <a href="./Overview.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        架构概述
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2" data-path="Framework/index.html">
            
                
                    <a href="./Framework/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        Framework
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="3" data-path="Modules/index.html">
            
                
                    <a href="./Modules/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>3.</b>
                        
                        模块及流程
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="4" data-path="Views/index.html">
            
                
                    <a href="./Views/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>4.</b>
                        
                        视图
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="5" data-path="Components/index.html">
            
                
                    <a href="./Components/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>5.</b>
                        
                        组件
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="6" data-path="Theme/index.html">
            
                
                    <a href="./Theme/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>6.</b>
                        
                        界面主题
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="7" data-path="International.html">
            
                
                    <a href="./International.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>7.</b>
                        
                        国际化
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="8" data-path="Extension.html">
            
                
                    <a href="./Extension.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>8.</b>
                        
                        扩展支持
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="9" data-path="Tools/index.html">
            
                
                    <a href="./Tools/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>9.</b>
                        
                        开发工具
                    </a>
            
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    Published with GitBook
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >概述</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h3 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h3>
<p>Rainbow &#x662F;&#x57FA;&#x4E8E; HTML5&#x3001;CSS3 &#x548C; JavaScript &#x5BF9; EAD &#x670D;&#x52A1;&#x5F15;&#x64CE;&#x63D0;&#x4F9B;&#x7684; Rest Service API &#x8FDB;&#x884C;&#x89E3;&#x6790;&#x548C;&#x6E32;&#x67D3;&#xFF0C;&#x52A8;&#x6001;&#x751F;&#x6210; Web &#x7528;&#x6237;&#x4EA4;&#x4E92;&#x754C;&#x9762;&#x7684;&#x524D;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6846;&#x67B6;&#x3002;&#x672C;&#x6587;&#x5BF9; Rainbow &#x524D;&#x7AEF;&#x6846;&#x67B6;&#x8FDB;&#x884C;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x5F00;&#x53D1; Rainbow &#x6240;&#x4F7F;&#x7528;&#x7684;&#x5173;&#x952E;&#x6280;&#x672F;&#x4ECB;&#x7ECD;&#xFF0C;Rainbow &#x5173;&#x952E;&#x672F;&#x8BED;&#x5B9A;&#x4E49;&#x3002;&#x5206;&#x522B;&#x4ECE;&#x67B6;&#x6784;&#x6982;&#x8FF0;&#x3001;&#x6838;&#x5FC3;&#x6846;&#x67B6;&#x9009;&#x578B;&#x3001;&#x6A21;&#x5757;&#x53CA;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x6D41;&#x7A0B;&#x3001;&#x89C6;&#x56FE;&#x3001;&#x7EC4;&#x4EF6;&#x3001;&#x754C;&#x9762;&#x4E3B;&#x9898;&#x3001;&#x56FD;&#x9645;&#x5316;&#x8BED;&#x8A00;&#x652F;&#x6301;&#x3001;&#x6269;&#x5C55;&#x5F00;&#x53D1;&#x3001;&#x751F;&#x6210;&#x5DE5;&#x5177;&#x7B49;&#x65B9;&#x9762;&#x7EFC;&#x5408;&#x8FDB;&#x884C;&#x6982;&#x8981;&#x8BF4;&#x660E;&#x3002;&#x672C;&#x6587;&#x65E8;&#x5728;&#x63CF;&#x8FF0; Rainbow &#x7684;&#x8BBE;&#x8BA1;&#x5F00;&#x53D1;&#x601D;&#x60F3;&#x548C;&#x8FD0;&#x884C;&#x539F;&#x7406;&#x53CA;&#x76F8;&#x5173;&#x751F;&#x6001;&#x4F9D;&#x8D56;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x6D89;&#x53CA;&#x5B9E;&#x8D28;&#x7684;&#x6269;&#x5C55;&#x5F00;&#x53D1;&#x8BF7;&#x53C2;&#x8003;&#x300A;&#x6269;&#x5C55;&#x5F00;&#x53D1;&#x6307;&#x5357;&#x300B;&#x3002;</p>
<h3 id="&#x5173;&#x952E;&#x6280;&#x672F;">&#x5173;&#x952E;&#x6280;&#x672F;</h3>
<h4 id="html-5">HTML 5</h4>
<p>HTML5 &#x662F; HTML &#x6700;&#x65B0;&#x7684;&#x4FEE;&#x8BA2;&#x7248;&#x672C;&#xFF0C;2014&#x5E74;10&#x6708;&#x7531;&#x4E07;&#x7EF4;&#x7F51;&#x8054;&#x76DF;&#xFF08;W3C&#xFF09;&#x5B8C;&#x6210;&#x6807;&#x51C6;&#x5236;&#x5B9A;&#x3002;&#x76EE;&#x6807;&#x662F;&#x53D6;&#x4EE3;1999&#x5E74;&#x6240;&#x5236;&#x5B9A;&#x7684; HTML 4.01 &#x548C; XHTML 1.0 &#x6807;&#x51C6;&#xFF0C;&#x4EE5;&#x671F;&#x80FD;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7F51;&#x7EDC;&#x6807;&#x51C6;&#x8FBE;&#x5230;&#x7B26;&#x5408;&#x5F53;&#x4EE3;&#x7684;&#x7F51;&#x7EDC;&#x9700;&#x6C42;&#x3002;&#x5E7F;&#x4E49;&#x8BBA;&#x53CA; HTML5 &#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x6307;&#x7684;&#x662F;&#x5305;&#x62EC; HTML&#x3001;CSS &#x548C; JavaScript &#x5728;&#x5185;&#x7684;&#x4E00;&#x5957;&#x6280;&#x672F;&#x7EC4;&#x5408;&#x3002;&#x5B83;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x51CF;&#x5C11;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x5668;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x63D2;&#x4EF6;&#x7684;&#x4E30;&#x5BCC;&#x6027;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x670D;&#x52A1;&#xFF08;Plug-in-Based Rich Internet Application&#xFF0C;RIA&#xFF09;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;AdobeFlash&#x3001;Microsoft Silverlight &#x4E0E; Oracle JavaFX &#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x80FD;&#x6709;&#x6548;&#x52A0;&#x5F3A;&#x7F51;&#x7EDC;&#x5E94;&#x7528;&#x7684;&#x6807;&#x51C6;&#x96C6;&#x3002;</p>
<h4 id="css-3">CSS 3</h4>
<p>CSS &#x5373;&#x5C42;&#x53E0;&#x6837;&#x5F0F;&#x8868;&#xFF08;Cascading StyleSheet&#xFF09;&#x3002; &#x5728;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x65F6;&#x91C7;&#x7528;&#x5C42;&#x53E0;&#x6837;&#x5F0F;&#x8868;&#x6280;&#x672F;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x5BF9;&#x9875;&#x9762;&#x7684;&#x5E03;&#x5C40;&#x3001;&#x5B57;&#x4F53;&#x3001;&#x989C;&#x8272;&#x3001;&#x80CC;&#x666F;&#x548C;&#x5176;&#x5B83;&#x6548;&#x679C;&#x5B9E;&#x73B0;&#x66F4;&#x52A0;&#x7CBE;&#x786E;&#x7684;&#x63A7;&#x5236;&#x3002; &#x53EA;&#x8981;&#x5BF9;&#x76F8;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x505A;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x540C;&#x4E00;&#x9875;&#x9762;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#xFF0C;&#x6216;&#x8005;&#x9875;&#x6570;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x9875;&#x7684;&#x5916;&#x89C2;&#x548C;&#x683C;&#x5F0F;&#x3002;CSS3 &#x662F; CSS &#x6280;&#x672F;&#x7684;&#x5347;&#x7EA7;&#x7248;&#x672C;&#xFF0C;CSS3 &#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x662F;&#x671D;&#x7740;&#x6A21;&#x5757;&#x5316;&#x53D1;&#x5C55;&#x7684;&#x3002;&#x4EE5;&#x524D;&#x7684;&#x89C4;&#x8303;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x5E9E;&#x5927;&#x800C;&#x4E14;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x628A;&#x5B83;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x66F4;&#x591A;&#x65B0;&#x7684;&#x6A21;&#x5757;&#x4E5F;&#x88AB;&#x52A0;&#x5165;&#x8FDB;&#x6765;&#x3002;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x5305;&#x62EC;&#xFF1A; &#x76D2;&#x5B50;&#x6A21;&#x578B;&#x3001;&#x5217;&#x8868;&#x6A21;&#x5757;&#x3001;&#x8D85;&#x94FE;&#x63A5;&#x65B9;&#x5F0F; &#x3001;&#x8BED;&#x8A00;&#x6A21;&#x5757; &#x3001;&#x80CC;&#x666F;&#x548C;&#x8FB9;&#x6846; &#x3001;&#x6587;&#x5B57;&#x7279;&#x6548; &#x3001;&#x591A;&#x680F;&#x5E03;&#x5C40;&#x7B49;&#x3002;</p>
<h4 id="javascript">JavaScript</h4>
<p>JavaScript &#x4E00;&#x79CD;&#x76F4;&#x8BD1;&#x5F0F;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x3001;&#x5F31;&#x7C7B;&#x578B;&#x3001;&#x57FA;&#x4E8E;&#x539F;&#x578B;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5185;&#x7F6E;&#x652F;&#x6301;&#x7C7B;&#x578B;&#x3002;&#x5B83;&#x7684;&#x89E3;&#x91CA;&#x5668;&#x88AB;&#x79F0;&#x4E3A; JavaScript &#x5F15;&#x64CE;&#xFF0C;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x6700;&#x65E9;&#x662F;&#x5728; HTML&#xFF08;&#x6807;&#x51C6;&#x901A;&#x7528;&#x6807;&#x8BB0;&#x8BED;&#x8A00;&#x4E0B;&#x7684;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#xFF09;&#x7F51;&#x9875;&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x7528;&#x6765;&#x7ED9; HTML &#x7F51;&#x9875;&#x589E;&#x52A0;&#x52A8;&#x6001;&#x529F;&#x80FD;&#x3002;</p>
<h4 id="json">JSON</h4>
<p>JSON(JavaScript Object Notation) &#x662F;&#x4E00;&#x79CD;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x683C;&#x5F0F;&#x3002;&#x5B83;&#x57FA;&#x4E8E; ECMAScript &#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#x3002; JSON &#x91C7;&#x7528;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4F7F;&#x7528;&#x4E86;&#x7C7B;&#x4F3C;&#x4E8E;C&#x8BED;&#x8A00;&#x5BB6;&#x65CF;&#x7684;&#x4E60;&#x60EF;&#xFF08;&#x5305;&#x62EC;C&#x3001;C++&#x3001;C#&#x3001;Java&#x3001;JavaScript&#x3001;Perl&#x3001;Python&#x7B49;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4F7F;JSON&#x6210;&#x4E3A;&#x7406;&#x60F3;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x8BED;&#x8A00;&#x3002; &#x6613;&#x4E8E;&#x4EBA;&#x9605;&#x8BFB;&#x548C;&#x7F16;&#x5199;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x6613;&#x4E8E;&#x673A;&#x5668;&#x89E3;&#x6790;&#x548C;&#x751F;&#x6210;(&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x63D0;&#x5347;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x901F;&#x7387;)&#x3002;</p>
<h4 id="amd">AMD</h4>
<p>AMD &#x5168;&#x79F0;&#x662F; Asynchronous Module Definition&#xFF0C;&#x5373;&#x5F02;&#x6B65;&#x6A21;&#x5757;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#x3002;AMD &#x89C4;&#x8303;&#x662F; JavaScript &#x5F00;&#x53D1;&#x7684;&#x4E00;&#x6B21;&#x91CD;&#x8981;&#x5C1D;&#x8BD5;&#xFF0C;&#x5B83;&#x4EE5;&#x7B80;&#x5355;&#x800C;&#x4F18;&#x96C5;&#x7684;&#x65B9;&#x5F0F;&#x7EDF;&#x4E00;&#x4E86; JavaScript &#x7684;&#x6A21;&#x5757;&#x5B9A;&#x4E49;&#x548C;&#x52A0;&#x8F7D;&#x673A;&#x5236;&#xFF0C;&#x5E76;&#x8FC5;&#x901F;&#x5F97;&#x5230;&#x5F88;&#x591A;&#x6846;&#x67B6;&#x7684;&#x8BA4;&#x53EF;&#x548C;&#x91C7;&#x7EB3;&#x3002;&#x8FD9;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x6D88;&#x606F;&#xFF0C;&#x901A;&#x8FC7;AMD&#x6211;&#x4EEC;&#x964D;&#x4F4E;&#x4E86;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x6846;&#x67B6;&#x7684;&#x95E8;&#x69DB;&#xFF0C;&#x80FD;&#x591F;&#x4EE5;&#x4E00;&#x79CD;&#x7EDF;&#x4E00;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x5B9A;&#x4E49;&#x548C;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#xFF0C;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x6548;&#x7387;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x5E94;&#x7528;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#x3002;</p>
<h4 id="web-storage">Web Storage</h4>
<p>Web Storage&#x5B9E;&#x9645;&#x4E0A;&#x7531;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;sessionStorage &#x4E0E; localStorage&#x3002; sessionStorage &#x7528;&#x4E8E;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#xFF08;session&#xFF09;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x53EA;&#x6709;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;&#x4E2D;&#x7684;&#x9875;&#x9762;&#x624D;&#x80FD;&#x8BBF;&#x95EE;&#x5E76;&#x4E14;&#x5F53;&#x4F1A;&#x8BDD;&#x7ED3;&#x675F;&#x540E;&#x6570;&#x636E;&#x4E5F;&#x968F;&#x4E4B;&#x9500;&#x6BC1;&#x3002;&#x56E0;&#x6B64; sessionStorage &#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x6301;&#x4E45;&#x5316;&#x7684;&#x672C;&#x5730;&#x5B58;&#x50A8;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x4F1A;&#x8BDD;&#x7EA7;&#x522B;&#x7684;&#x5B58;&#x50A8;&#x3002; localStorage &#x7528;&#x4E8E;&#x6301;&#x4E45;&#x5316;&#x7684;&#x672C;&#x5730;&#x5B58;&#x50A8;&#xFF0C;&#x9664;&#x975E;&#x4E3B;&#x52A8;&#x5220;&#x9664;&#x6570;&#x636E;&#xFF0C;&#x5426;&#x5219;&#x6570;&#x636E;&#x662F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8FC7;&#x671F;&#x7684;&#x3002;</p>
<h3 id="&#x672F;&#x8BED;&#x5B9A;&#x4E49;">&#x672F;&#x8BED;&#x5B9A;&#x4E49;</h3>
<h4 id="view">View</h4>
<p>Rainbow &#x7684;&#x6838;&#x5FC3;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#x62BD;&#x8C61;&#xFF0C;&#x5206;&#x4E3A;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#xFF08;View Model&#xFF09;&#x548C;&#x89C6;&#x56FE;&#xFF08;View&#xFF09;&#xFF0C;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x8D1F;&#x8D23;&#x4E0E;&#x670D;&#x52A1;&#x7AEF; API &#x8FDB;&#x884C;&#x6570;&#x636E;&#x540C;&#x6B65;&#xFF0C;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x6536;&#x5230; API &#x8FD4;&#x56DE;&#x7684;&#x6570;&#x636E;&#x540E;&#x6839;&#x636E;&#x89C6;&#x56FE;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x9009;&#x62E9;&#x76F8;&#x5E94;&#x7C7B;&#x578B;&#x7684;&#x89C6;&#x56FE;&#x8FDB;&#x884C;&#x754C;&#x9762;&#x52A8;&#x6001;&#x6E32;&#x67D3;&#x3002;&#x89C6;&#x56FE;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x754C;&#x9762;&#x7EC4;&#x4EF6;&#x7684;&#x5BB9;&#x5668;&#x7EC4;&#x4EF6;&#xFF0C;&#x4E00;&#x822C;&#x89C6;&#x56FE;&#x7531;&#x52A8;&#x4F5C;&#x680F;&#x3001;&#x8FC7;&#x6EE4;&#x5668;&#x680F;&#x3001;&#x6570;&#x636E;&#x5217;&#x8868;&#x3001;&#x72B6;&#x6001;&#x680F;&#x3001;&#x5206;&#x9875;&#x680F;&#x3001;&#x8BBE;&#x7F6E;&#x680F;&#x7B49;&#x529F;&#x80FD;&#x7EC4;&#x4EF6;&#x7EC4;&#x6210;&#x3002;&#x5404;&#x529F;&#x80FD;&#x7EC4;&#x4EF6;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#xFF0C;&#x6839;&#x636E;&#x5BF9;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x7684;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x6765;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x3002;</p>
<h4 id="action">Action</h4>
<p>Rainbow &#x7684;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#x62BD;&#x8C61;&#xFF0C;Action &#x4F5C;&#x4E3A;&#x89C6;&#x56FE;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x4EF6;&#xFF0C;&#x6839;&#x636E;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x7684;&#x8303;&#x5F0F;&#x5B9A;&#x4E49;&#xFF08;Schema&#xFF09;&#x52A8;&#x6001;&#x6E32;&#x67D3;&#x6570;&#x636E;&#x8868;&#x5355;&#x548C;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6821;&#x9A8C;&#xFF0C;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x8868;&#x5355;&#x8F93;&#x5165;&#x6216;&#x53D8;&#x66F4;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x81EA;&#x52A8;&#x540C;&#x6B65;&#x66F4;&#x65B0;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x7ED1;&#x5B9A;&#xFF0C;&#x6700;&#x540E;&#x901A;&#x8FC7; Restful &#x4E0E;&#x670D;&#x52A1;&#x7AEF; API &#x4EA4;&#x4E92;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x3002;Action &#x662F; Rainbow &#x4E2D;&#x6700;&#x590D;&#x6742;&#x548C;&#x4E1A;&#x52A1;&#x591A;&#x6837;&#x5F0F;&#x8981;&#x6C42;&#x6700;&#x591A;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x7CFB;&#x7EDF;&#x5185;&#x7F6E;&#x4E86;&#x521B;&#x5EFA;&#xFF08;POST&#xFF09;&#x3001;&#x66F4;&#x65B0;&#xFF08;PUT&#xFF09;&#x3001;&#x5220;&#x9664;&#xFF08;DELETE&#xFF09;&#x3001;&#x5355;&#x6761;&#x6570;&#x636E;&#x5904;&#x7406;&#xFF08;one&#xFF09;&#x3001;&#x591A;&#x6761;&#x6570;&#x636E;&#x5904;&#x7406;&#xFF08;batch&#xFF09;&#x3001;&#x5355;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#xFF08;file&#xFF09;&#x3001;&#x591A;&#x6587;&#x4EF6;&#x4E0A;&#x4F20;&#xFF08;upload&#xFF09;&#x3001;&#x4E0B;&#x8F7D;&#xFF08;download&#xFF09;&#x7B49;&#x5E38;&#x7528;&#x52A8;&#x4F5C;&#x7EC4;&#x4EF6;&#xFF0C;&#x4E5F;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x9A71;&#x52A8;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x52A8;&#x4F5C;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x3002;</p>
<h3 id="&#x53C2;&#x8003;&#x8D44;&#x6599;">&#x53C2;&#x8003;&#x8D44;&#x6599;</h3>
<ul>
<li>&#x300A;&#x5E73;&#x53F0;&#x67B6;&#x6784;&#x8BF4;&#x660E;&#x300B;;</li>
<li>&#x300A;&#x6269;&#x5C55;&#x5F00;&#x53D1;&#x6307;&#x5357;&#x300B;;</li>
<li>&#x300A;&#x767E;&#x5EA6;&#x767E;&#x79D1;&#x300B;;</li>
</ul>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        
        <a href="./Overview.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 架构概述"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-search/lunr.min.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-search/search.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-sharing/buttons.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"highlight":{},"search":{"maxIndexSize":1000000},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        
    </body>
    
</html>
